#
# 字符串的写入方式
str1 = '我是字符串'
str2 = """------------------------
我是
    多个
        字符串
------------------------"""

print(str1)
print(str2)

#
# 换行符和制表位
print('好好学习\n天天向上')

print('项目名称\t进度\t完成日期')
print('A项目\t50%\t2024/5/21')
print('------------------------')

#
# 转义字符失效
print('字\\符\\n串')
print(r'字\符\n串')
print(R'字\符\n串')
print('------------------------')

#
# 在''前加f可以在''添加表达式。详见函数的定义和调用 print(f'1到{num}的累加和为{s}')

#
# 字符串的切片和索引
str3 = '我是一个字符串'
print(str3[0:2])
print(str3[-7:-5])
print('我是一个字符串'[0:2])
print('我是一个字符串'[-7:-5])
print('------------------------')

#
# 对字符串的操作
str4 = '2024年'
str5 = '普京来中国'
str6 = '哈'
print(str4 + str5)
print('普京' in str5)
print('普京' in str4)
print(str6*10)

