"""
字典可以增删改查，字典元素无序
字典属于序列
键和值：列表不能作为键。键不能相同，但值可以相同
字典的创建：用{}直接创建
"""
#
# 字典的创建
d = {10: 'cat', 20: 'dog', 30: 'zoo', 20: '66666666666'}  # 用{}直接创建字典
print(d)  # 键相同时，后面的相同键的元素会覆盖前面的

print('-' * 20)
lst1 = [10, 20, 30, 40]  # 用zip函数创建zip对象，转成字典
lst2 = ['cat', 'dog', 'pet', 'zoo', '66666666666']
d2 = zip(lst1, lst2)
print(d2)  # zip函数创建的是zip对象<zip object at 0x000001D9560F7380>
d2 = dict(d2)
print(d2)  # 没有键的元素直接舍弃了

print('-' * 20)
d3 = dict(cat=10, dog=20, pet=30)  # 使用dict()创建字典
print(d3)  # 此时字符串是键

#
# 元组可以做为字典的键
t = (10, 20, 30)
print({t: 20})  # 元组可以做为键

#
# 字典的删除
del d
del d2
del d3
